Revit 2027 API
SymbolTypeId.UsDollar Property
 Symbol $, indicating unit Currency.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId UsDollar { get; }
Public Shared ReadOnly Property UsDollar As ForgeTypeId
	Get
public:
static property ForgeTypeId^ UsDollar {
	ForgeTypeId^ get ();
}
static member UsDollar : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace